/**
 * @file slib.c
 * @author WHXY
 * @brief
 * @version 0.1
 * @date 2022-7-12
 *
 * @copyright Copyright (c) 2021
 *
 */
/*******************************************************************************
*
* 代码许可和免责信息
* 武汉芯源半导体有限公司授予您使用所有编程代码示例的非专属的版权许可，您可以由此
* 生成根据您的特定需要而定制的相似功能。根据不能被排除的任何法定保证，武汉芯源半
* 导体有限公司及其程序开发商和供应商对程序或技术支持（如果有）不提供任何明示或暗
* 含的保证或条件，包括但不限于暗含的有关适销性、适用于某种特定用途和非侵权的保证
* 或条件。
* 无论何种情形，武汉芯源半导体有限公司及其程序开发商或供应商均不对下列各项负责，
* 即使被告知其发生的可能性时，也是如此：数据的丢失或损坏；直接的、特别的、附带的
* 或间接的损害，或任何后果性经济损害；或利润、业务、收入、商誉或预期可节省金额的
* 损失。
* 某些司法辖区不允许对直接的、附带的或后果性的损害有任何的排除或限制，因此某些或
* 全部上述排除或限制可能并不适用于您。
*
*******************************************************************************/
/******************************************************************************
 * Include files
 ******************************************************************************/
#include "slib.h"
#include "cw32l012_sysctrl.h"
#include "cw32l012_gpio.h"


/******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/

#define LED2_PORT        CW_GPIOB
#define LED2_PIN         GPIO_PIN_8
#define LED2_ON()        PB08_SETHIGH()
#define LED2_OFF()       PB08_SETLOW()
#define LED2_TOG()       PB08_TOG()


/******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/


/******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/


/******************************************************************************
 * Local variable definitions ('static')                                      *
 ******************************************************************************/

/******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/

/*****************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @brief LED闪烁 
 * 不可调用安全区外的函数
 * @param Cnt: 闪烁次数
 * @return 
 */
void Slib_Led_Blink(uint32_t Cnt)
{
    __SYSCTRL_GPIOA_CLK_ENABLE();
    __SYSCTRL_GPIOB_CLK_ENABLE();
    
    LED2_PORT->ANALOG &= (~LED2_PIN);
    LED2_PORT->DIR    &= (~LED2_PIN);
    LED2_PORT->ODR    &= (~LED2_PIN);
    
    while(Cnt)
    {
        LED2_TOG();
        Slib_Delay(200000);
        Cnt--;
    }
}
/*******************************************************************************
 * @brief  Slib区函数，Delay函数
 * @param  DlyCnt : Delay 的计数
 * @retval None
 */
void Slib_Delay(uint32_t DlyCnt)
{
    while(DlyCnt)
    {
        DlyCnt--;
    }
}
